## Staging: cloudfront
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 3 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                               NAME                                |
|--------|-------------------------------------------------------------------|
| add    | `aws_acm_certificate_validation.assets-notification-canada-ca[0]` |
|        | `aws_route53_record.assets-notification-CNAME`                    |
|        | `aws_route53_record.assets-notification-canada-ca[0]`             |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_acm_certificate_validation.assets-notification-canada-ca[0] will be created
  + resource "aws_acm_certificate_validation" "assets-notification-canada-ca" {
      + certificate_arn         = "arn:aws:acm:us-east-1:239043911459:certificate/573a13c4-616a-4879-b027-f9c9569b2830"
      + id                      = (known after apply)
      + validation_record_fqdns = (known after apply)
    }

  # aws_route53_record.assets-notification-CNAME will be created
  + resource "aws_route53_record" "assets-notification-CNAME" {
      + allow_overwrite = (known after apply)
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "assets.staging.notification.cdssandbox.xyz"
      + records         = [
          + "d3ukkp8cndubgn.cloudfront.net",
        ]
      + ttl             = 300
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

  # aws_route53_record.assets-notification-canada-ca[0] will be created
  + resource "aws_route53_record" "assets-notification-canada-ca" {
      + allow_overwrite = true
      + fqdn            = (known after apply)
      + id              = (known after apply)
      + name            = "_0b5616f644860f7b52e4931e38065c17.assets.staging.notification.cdssandbox.xyz"
      + records         = [
          + "_e9aaf2a3c80241e41690c26522275c0c.wggjkglgrm.acm-validations.aws.",
        ]
      + ttl             = 60
      + type            = "CNAME"
      + zone_id         = "/hostedzone/Z04028033PLSHVOO9ZJ1Z"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_acm_certificate.assets-notification-canada-ca"]
WARN - plan.json - main - Missing Common Tags: ["aws_cloudfront_distribution.asset_bucket"]
WARN - plan.json - main - Missing Common Tags: ["aws_wafv2_web_acl.assets_cdn"]

20 tests, 17 passed, 3 warnings, 0 failures, 0 exceptions

```

</details>
